Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3-home-ipd will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3-home-ipd"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:GetObjectVersion",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::246850902828:user/github-actions",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_iam_user.github-actions will be updated in-place
~ resource "aws_iam_user" "github-actions" {
        id            = "github-actions"
        name          = "github-actions"
        tags          = {}
      ~ tags_all      = {
          + "project" = "findafoodtruck"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.s3-home will be created
+ resource "aws_s3_bucket" "s3-home" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "project" = "findafoodtruck"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # aws_s3_bucket.s3_home will be destroyed
  # (because aws_s3_bucket.s3_home is not in configuration)
- resource "aws_s3_bucket" "s3_home" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::terraform-20220121192859548500000001" -> null
      - bucket                      = "terraform-20220121192859548500000001" -> null
      - bucket_domain_name          = "terraform-20220121192859548500000001.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "terraform-20220121192859548500000001.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "terraform-20220121192859548500000001" -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.us-east-2.amazonaws.com" -> null
      - website_endpoint            = "terraform-20220121192859548500000001.s3-website.us-east-2.amazonaws.com" -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_policy.public-read must be replaced
-/+ resource "aws_s3_bucket_policy" "public-read" {
      ~ bucket = "terraform-20220121192859548500000001" -> (known after apply) # forces replacement
      ~ id     = "terraform-20220121192859548500000001" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::terraform-20220121192859548500000001/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                      - Resource  = "arn:aws:s3:::terraform-20220121192859548500000001/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # github_actions_secret.S3_BUCKET must be replaced
-/+ resource "github_actions_secret" "S3_BUCKET" {
      ~ created_at      = "2022-01-22 11:16:04 +0000 UTC" -> (known after apply)
      ~ id              = "foodtrucks:S3_BUCKET" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-01-22 11:16:04 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 3 to add, 1 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
